app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
    def index
        @artist = Artist.all

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        artist = Artist.find(params[:id])

SELECT "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "Sleepyfoot?"], ["LIMIT", 1]]
---
    def login
        artist = Artist.find_by(name: params[:userLogin])