app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        artworks = Artwork.all

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "name" = $1, "price" = $2, "medium" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["name", "Jorge"], ["price", 20], ["medium", "Oil "], ["updated_at", "2020-08-21 04:06:28.117002"], ["id", 2]]
---
    def update
        byebug
        artwork = Artwork.find(params[:id])
        artwork.update(updateparams)

INSERT INTO "artworks" ("name", "price", "medium", "image", "availability", "dimension", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        newArt = Artwork.create(artparams)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]
---
    def delete
        artwork = Artwork.find(params[:id])
        artwork.destroy