app/controllers/collectors_controller.rb

    def index
        @collector = Collector.all
---
SELECT "collectors".* FROM "collectors"

    def login

        collector = Collector.find_by(name: params[:userLogin])
---
SELECT "collectors".* FROM "collectors" WHERE "collectors"."name" = $1 LIMIT $2  [["name", "Damien Hirst"], ["LIMIT", 1]]