app/controllers/favorites_controller.rb

    def index
        favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def show
        favorite = Favorite.find(params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        favorite = Favorite.create(favParams)
---
INSERT INTO "favorites" ("artwork_id", "collector_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["collector_id", 5], ["created_at", "2020-08-21 02:39:14.376091"], ["updated_at", "2020-08-21 02:39:14.376091"]]